package com.hillel.lesson_14.tasksStreams;

public class Text {
    public final static String text = """

            В одном селе, возле Блудова болота, в районе города Переславль-Залесского, осиротели двое детей. Их мать умерла от болезни, отец погиб на Отечественной войне.

            Мы жили в этом селе всего только через один дом от детей. И, конечно, мы тоже вместе с другими соседями старались помочь им, чем только могли. Они были очень милые. Настя была, как золотая Курочка на высоких ножках. Волосы у нее, ни темные, ни светлые, отливали золотом, веснушки по всему лицу были крупные, как золотые монетки, и частые, и тесно им было, и лезли они во все стороны. Только носик один был чистенький и глядел вверх.

            Митраша был моложе сестры на два года. Ему было всего только десять лет с хвостиком. Он был коротенький, но очень плотный, лобастый, затылок широкий. Это был мальчик упрямый и сильный.

            «Мужичок в мешочке», улыбаясь, называли его между собой учителя в школе.

            «Мужичок в мешочке», как и Настя, был весь в золотых веснушках, а носик его, чистенький тоже, как у сестры, глядел вверх.

            После родителей все их крестьянское хозяйство досталось детям: изба пятистенная, корова Зорька, телушка Дочка, коза Дереза. Безыменные овцы, куры, золотой петух Петя и поросенок Хрен.

            Вместе с этим богатством досталось, однако, детишкам бедным и большая забота о всех живых существах. Но с такой ли бедой справлялись наши дети в тяжкие годы Отечественной войны! Вначале, как мы уже говорили, к детям приходили помогать их дальние родственники и все мы, соседи. Но очень что-то скоро умненькие и дружные ребята сами всему научились и стали жить хорошо.

            И какие это были умные детишки! Если только возможно было, они присоединялись к общественной работе. Их носики можно было видеть на колхозных полях, на лугах, на скотном дворе, на собраниях, в противотанковых рвах: носики такие задорные.

            В этом селе мы, хотя и приезжие люди, знали хорошо жизнь каждого дома. И теперь можем сказать: не было ни одного дома, где бы жили и работали так дружно, как жили наши любимцы.

            Точно так же, как и покойная мать, Настя вставала далеко до солнца, в предрассветный час, по трубе пастуха. С хворостиной в руке выгоняла она свое любимое стадо и катилась обратно в избу. Не ложась уже больше спать, она растопляла печь, чистила картошку, заправляла обед, и так хлопотала по хозяйству до ночи.

            Митраша выучился у отца делать деревянную посуду: бочонки, шайки, лохани. У него есть фуганок, ладило длиной больше чем в два его роста. И этим ладилом он подгоняет дощечки одну к одной, складывает и обдерживает железными или деревянными обручами.

            При корове двум детям не было такой уж нужды, чтобы продавать на рынке деревянную посуду, но добрые люди просят, кому шайку на умывальник, кому нужен под капели бочонок, кому кадушечка солить огурцы или грибы, или даже простую посудинку с зубчиками – домашний цветок посадить.

            Сделает, и потом ему тоже отплатят добром. Но, кроме бондарства, на нем лежит и все мужское хозяйство и общественное дело. Он бывает на всех собраниях, старается понять общественные заботы и, наверно, что-то смекает.

            Очень хорошо, что Настя постарше брата на два года, а то бы он непременно зазнался и в дружбе у них не было бы, как теперь, прекрасного равенства. Бывает, и теперь Митраша вспомнит, как отец наставлял его мать, и вздумает, подражая отцу, тоже учить свою сестру Настю. Но сестренка мало слушается, стоит и улыбается.

            Тогда «Мужичок в мешочке» начинает злиться и хорохориться и всегда говорит, задрав нос:

            – Вот еще!

            – Да чего ты хорохоришься? – возражает сестра.

            – Вот еще! – сердится брат. – Ты, Настя, сама хорохоришься.

            – Нет, это ты!

            – Вот еще!

            Так, помучив строптивого брата, Настя оглаживает его по затылку. И как только маленькая ручка сестры коснется широкого затылка брата, отцовский задор покидает хозяина.

            – Давай-ка вместе полоть, – скажет сестра.

            И брат тоже начинает полоть огурцы, или свеклу мотыжить, или картошку окучивать.

            II

            Кислая и очень полезная для здоровья ягода клюква растет в болотах летом, а собирают ее поздней осенью. Но не все знают, что самая-самая хорошая клюква, сладкая, как у нас говорят, бывает, когда она перележит зиму под снегом.

            Этой весной снег в густых ельниках еще держался и в конце апреля, но в болотах всегда бывает много теплее: там в это время снега уже не было вовсе. Узнав об этом от людей, Митраша и Настя стали собираться за клюквой. Еще до свету Настя задала корм всем своим животным. Митраша взял отцовское двуствольное ружье «Тулку», манки на рябчиков и не забыл тоже и компас. Никогда, бывало, отец его, направляясь в лес, не забудет этого компаса. Не раз Митраша спрашивал отца:

            – Всю жизнь ты ходишь по лесу, и тебе лес известен весь, как ладонь. Зачем же тебе еще нужна эта стрелка?

            – Видишь, Дмитрий Павлович, – отвечал отец, – в лесу эта стрелка тебе добрей матери: бывает, небо закроется тучами, и по солнцу в лесу ты определиться не можешь, пойдешь наугад, ошибешься, заблудишься, заголодаешь. Вот тогда взгляни только на стрелку – и она укажет тебе, где твой дом. Пойдешь прямо по стрелке домой, и тебя там покормят. Стрелка эта тебе верней друга: бывает, друг твой изменит тебе, а стрелка неизменно всегда, как ее ни верти, все на север глядит.

            Осмотрев чудесную вещь, Митраша запер компас, чтобы стрелка в пути зря не дрожала. Он хорошо, по-отцовски, обернул вокруг ног портянки, вправил в сапоги, картузик надел такой старый, что козырек его разделился надвое: верхняя корочка задралась выше солнца, а нижняя спускалась почти до самого носика. Оделся же Митраша в отцовскую старую куртку, вернее же в воротник, соединяющий полосы когда-то хорошей домотканной материи. На животике своем мальчик связал эти полосы кушаком, и отцовская куртка села на нем, как пальто, до самой земли. Еще сын охотника заткнул за пояс топор, сумку с компасом повесил на правое плечо, двуствольную «Тулку» – на левое и так сделался ужасно страшным для всех птиц и зверей.

            Настя, начиная собираться, повесила себе через плечо на полотенце большую корзину.

            – Зачем тебе полотенце? – спросил Митраша.

            – А как же? – ответила Настя. – Ты разве не помнишь, как мама за грибами ходила?

            – За грибами! Много ты понимаешь: грибов бывает много, так плечо режет.

            – А клюквы, может быть, у нас еще больше будет.

            И только хотел сказать Митраша свое «вот еще!», вспомнилось ему, как отец о клюкве сказал, еще когда собирали его на войну.

            – Ты это помнишь, – сказал Митраша сестре, – как отец нам говорил о клюкве, что есть палестинка в лесу.

            – Помню, – ответила Настя, – о клюкве говорил, что знает местечко и клюква там осыпучая, но что он о какой-то палестинке говорил, я не знаю. Еще помню, говорил про страшное место Слепую елань.

            – Вот там, возле елани, и есть палестинка, – сказал Митраша. – Отец говорил: идите на Высокую гриву и после того держите на север и, когда перевалите через Звонкую борину, держите все прямо на север и увидите – там придет вам палестинка, вся красная, как кровь, от одной только клюквы. На этой палестинке еще никто не бывал.

            Митраша говорил это уже в дверях.

            Настя во время рассказа вспомнила: у нее от вчерашнего дня остался целый, нетронутый чугунок вареной картошки. Забыв о палестинке, она тихонечко шмыгнула к загнетке и опрокинула в корзинку весь чугунок.

            «Может быть, еще и заблудимся, – подумала она. – Хлеба у нас взято довольно, есть бутылка молока, и картошка, может быть, тоже пригодится».

            А брат в это время, думая, что сестра все стоит за его спиной, рассказывал ей о чудесной палестинке и что, правда, на пути к ней Слепая елань, где много погибло и людей, и коров, и коней.

            – Ну, так что это за палестинка? – спросила Настя.

            – Так ты ничего не слыхала?! – схватился он.

            И терпеливо повторил ей уже на ходу все, что слышал от отца о не известной никому палестинке, где растет сладкая клюква.

            III

            Блудово болото, где и мы сами не раз тоже блуждали, начиналось, как почти всегда начинается большое болото, непроходимою зарослью ивы, ольхи и других кустарников. Первый человек прошел эту приболотицу с топором в руке и вырубил проход для других людей. Под ногами человеческими после осели кочки, и тропа стала канавкой, по которой струилась вода. Дети без особого труда перешли эту приболотицу в предрассветной темноте. И когда кустарники перестали заслонять вид впереди, при первом утреннем свете им открылось болото, как море. А впрочем, оно же и было, это Блудово болото, дном древнего моря. И как там, в настоящем море, бывают острова, как в пустынях – оазисы, так и в болотах бывают холмы. У нас в Блудовом болоте эти холмы песчаные, покрытые высоким бором, называются боринами. Пройдя немного болотом, дети поднялись на первую борину, известную под названием Высокая грива. Отсюда с высокой пролысинки в серой дымке первого рассвета чуть виднелась борина Звонкая.

            Еще, не доходя до Звонкой борины, почти возле самой тропы, стали показываться отдельные кроваво-красные ягоды. Охотники за клюквой поначалу клали эти ягоды в рот. Кто не пробовал в жизни своей осеннюю клюкву и сразу бы хватил весенней, у него бы дух захватило от кислоты. Но брат и сестра знали хорошо, что такое осенняя клюква, и оттого, когда теперь ели весеннюю, то повторяли:

            – Какая сладкая!

            Борина Звонкая охотно открыла детям свою широкую просеку, покрытую и теперь, в апреле, темно-зеленой брусничной травой. Среди этой зелени прошлого года кое-где виднелись новые цветочки белого подснежника и лиловые, мелкие и ароматные цветочки волчьего лыка.

            – Они хорошо пахнут, попробуй сорви цветочек волчьего лыка, – сказал Митраша.

            Настя попробовала надломить прутик стебелька и никак не могла.

            – А почему это лыко называется волчьим? – спросила она.

            – Отец говорил, – ответил брат, – волки из него себе корзинки плетут.

            И засмеялся.

            – А разве тут есть еще волки?

            – Ну, как же! Отец говорил, тут есть страшный волк Серый помещик.

            – Помню, тот самый, что порезал перед войной наше стадо.

            – Отец говорил, он живет на Сухой речке в завалах.

            – Нас с тобой он не тронет?

            – Пусть попробует, – ответил охотник с двойным козырьком.

            Пока дети так говорили и утро подвигалось все больше к рассвету, борина Звонкая наполнилась птичьими песнями, воем, стоном и криком зверьков. Не все они были тут, на борине, но с болота, сырого, глухого, все звуки собирались сюда. Борина с лесом, сосновым и звонким на суходоле, отзывалась всему.

            Но бедные птички и зверушки, как мучились все они, стараясь выговорить какое-то общее всем, единое прекрасное слово! И даже дети, такие простые, как Настя и Митраша, понимали их усилие. Им всем хотелось сказать одно только какое-то слово прекрасное.

            Видно, как птица поет на сучке, и каждое перышко дрожит у нее от усилия. Но все-таки слова, как мы, они сказать не могут, и им приходится выпевать, выкрикивать, выстукивать.

            – Тэк-тэк! – чуть слышно постукивает огромная птица Глухарь в темном лесу.

            – Шварк-шварк! – дикий Селезень в воздухе пролетел над речкой.

            – Кряк-кряк! – дикая утка Кряква на озере.

            – Гу-гу-гу! – красивая птичка Снегирь на березе.

            Бекас, небольшая серая птичка с носом, длинным, как сплющенная шпилька, раскатывается в воздухе диким барашком. Вроде как бы «жив, жив!» кричит кулик Кроншнеп. Тетерев там где-то бормочет и чуфыкает Белая Куропатка, как будто ведьма, хохочет.

            Мы, охотники, давно, с детства своего, и различаем, и радуемся, и хорошо понимаем, над каким словом все они трудятся и не могут сказать. Вот почему мы, когда придем в лес ранней весной на рассвете и услышим, так и скажем им, как людям, это слово.

            – Здравствуйте!

            И как будто они тогда тоже обрадуются, как будто они тогда тоже подхватят чудесное слово, слетевшее с языка человеческого.

            И закрякают в ответ, и зачуфыкают, и зашваркают, и затэтэкают, стараясь всеми голосами своими ответить нам:

            – Здравствуйте, здравствуйте, здравствуйте!

            Но вот среди всех этих звуков вырвался один – ни на что не похожий.

            – Ты слышишь? – спросил Митраша.

            – Как же не слышать! – ответила Настя. – Давно слышу, и как-то страшно.

            – Ничего нет страшного. Мне отец говорил и показывал: это так весной заяц кричит.

            – А зачем?

            – Отец говорил: он кричит «Здравствуй, зайчиха!»

            – А это что ухает?

            – Отец говорил это ухает выпь, бык водяной.

            – И чего он ухает?

            – Отец говорил у него есть тоже своя подруга, и он ей по-своему тоже так говорит, как и все: «Здравствуй, выпиха».

            И вдруг стало свежо и бодро, как будто вся земля сразу умылась, и небо засветилось, и все деревья запахли корой своей и почками. Вот тогда как будто над всеми звуками вырвался, вылетел и все покрыл особый, торжествующий крик, похожий, как если бы все люди радостно в стройном согласии могли закричать.

            – Победа, победа!

            – Что это? – спросила обрадованная Настя.

            – Отец говорил это так журавли солнце встречают. Это значит, что скоро солнце взойдет.

            Но солнце еще не взошло, когда охотники за сладкой клюквой спустились в большое болото. Тут еще совсем и не начиналось торжество встречи солнца. Над маленькими корявыми елочками и березками серой мглой висело ночное одеяло и глушило все чудесные звуки Звонкой борины. Только слышался тут тягостный, щемящий и нерадостный вой.

            – Что это, Митраша, – спросила Настенька, ежась, – так страшно воет вдали?

            – Отец говорил, – ответил Митраша, – это воют на Сухой речке волки, и, наверно, сейчас это воет волк Серый помещик. Отец говорил, что все волки на Сухой речке убиты, но Серого убить невозможно.

            – Так отчего же он страшно воет теперь?

            – Отец говорил волки воют весной оттого, что им есть теперь нечего. А Серый еще остался один, вот и воет.

            Болотная сырость, казалось, проникала сквозь тело к костям и студила их. И так не хотелось еще ниже спускаться в сырое, топкое болото.

            – Мы куда же пойдем? – спросила Настя.

            Митраша вынул компас, установил север и, указывая на более слабую тропу, идущую на север, сказал:

            – Мы пойдем на север по этой тропе.

            – Нет, – ответила Настя, – мы пойдем вот по этой большой тропе, куда все люди идут. Отец нам рассказывал, помнишь, какое это страшное место – Слепая елань, сколько погибло в нем людей и скота. Нет, нет, Митрашенька, не пойдем туда. Все идут в эту сторону, значит там и клюква растет.

            – Много ты понимаешь! – оборвал ее охотник – Мы пойдем на север, как отец говорил, там есть палестинка, где еще никто не бывал.

            Настя, заметив, что брат начинает сердиться, вдруг улыбнулась и погладила его по затылку. Митраша сразу успокоился, и друзья пошли по тропе, указанной стрелкой, теперь уже не рядом, как раньше, а друг за другом, гуськом.

            IV

            Лет двести тому назад ветер-сеятель принес два семечка в Блудово болото: семя сосны и семя ели. Оба семечка легли в одну ямку возле большого плоского камня. С тех пор уже лет, может быть, двести эти ель и сосна вместе растут. Их корни с малолетства сплелись, их стволы тянулись вверх рядом к свету, стараясь обогнать друг друга. Деревья разных пород боролись между собой корнями за питание, сучьями – за воздух и свет. Поднимаясь все выше, толстея стволами, они впивались сухими сучьями в живые стволы и местами насквозь прокололи друг друга. Злой ветер устроив деревьям такую несчастную жизнь, прилетал сюда иногда покачать их. И тогда деревья так стонали и выли на все Блудово болото, как живые существа, что лисичка, свернувшаяся на моховой кочке в клубочек, поднимала вверх свою острую мордочку. До того близок был живым существам этот стон и вой сосны и ели, что одичавшая собака в Блудовом болоте, услыхав его, выла от тоски по человеку, а волк выл от неизбывной злобы к нему.

            Сюда, к Лежачему камню, пришли дети в то самое время, когда первые лучи солнца, пролетев над низенькими корявыми болотными елочками и березками, осветили Звонкую борину и могучие стволы соснового бора стали, как зажженные свечи великого храма природы. Оттуда сюда, к этому плоскому камню, где сели отдохнуть дети, слабо долетело пение птиц, посвященное восходу великого солнца.

            Было совсем тихо в природе, и дети, озябшие, до того были тихи, что тетерев Косач не обратил на них никакого внимания. Он сел на самом верху, где сук сосны и сук ели сложились, как мостик между двумя деревьями. Устроившись на этом мостике, для него довольно широком, ближе к ели, Косач как будто стал расцветать в лучах восходящего солнца. На голове его гребешок загорелся огненным цветком. Синяя в глубине черного грудь его стала переливать из синего на зеленое. И особенно красив стал его радужный, раскинутый лирой хвост.

            Завидев солнце над болотными жалкими елочками, он вдруг подпрыгнул на своем высоком мостике, показал свое белое, чистейшее белье подхвостья, подкрылья и крикнул:

            – Чуф, ши!

            По-тетеревиному «чуф», скорее всего, значило солнце, а «ши», вероятно, было у них наше «здравствуй».

            В ответ на это первое чуфыканье Косача-токовика далеко по всему болоту раздалось такое же чуфыканье с хлопаньем крыльев, и вскоре со всех сторон сюда стали прилетать и садиться вблизи Лежачего камня десятки больших птиц, как две капли воды похожих на Косача.

            Затаив дыхание, сидели дети на холодном камне, дожидаясь, когда и к ним придут лучи солнца и обогреют их хоть немного. И вот первый луч, скользнув по верхушкам ближайших, очень маленьких елочек, наконец-то заиграл на щеках у детей. Тогда верхний Косач, приветствуя солнце, перестал подпрыгивать и чуфыкать. Он присел низко на мостике у вершины елки, вытянул свою длинную шею вдоль сука и завел долгую, похожую на журчание ручейка песню. В ответ ему тут где-то вблизи сидящие на земле десятки таких же птиц, тоже – каждый петух, – вытянув шею, затянули ту же самую песню. И тогда как будто довольно уже большой ручей с бормотаньем побежал по невидимым камешкам.

            Сколько раз мы, охотники, выждав темное утро, на зябкой заре с трепетом слушали это пение, стараясь по-своему понять, о чем поют петухи. И когда мы по-своему повторяли их бормотанье, то у нас выходило:

            Круты перья,
            Ур-гур-гу,
            Круты перья
            Обор-ву, оборву.

            Так бормотали дружно тетерева, собираясь в то же время подраться. И когда они так бормотали, случилось небольшое событие в глубине еловой густой кроны. Там сидела на гнезде ворона и все время таилась там от Косача, токующего почти возле самого гнезда. Ворона очень бы желала прогнать Косача, но она боялась оставить гнездо и остудить на утреннем морозе яйца. Стерегущий гнездо ворона-самец в это время делал свой облет и, наверно, встретив что-нибудь подозрительное, задержался. Ворона в ожидании самца залегла в гнезде, была тише воды, ниже травы. И вдруг, увидев летящего обратно самца, крикнула свое:

            — Кра!

            Это значило у нее:

            — Выручай!

            — Кра! — ответил самец в сторону тока в том смысле, что еще неизвестно, кто кому оборвет круты перья.

            Самец, сразу поняв, в чем тут дело, спустился и сел на тот же мостик, возле елки, у самого гнезда, где Косач токовал, только поближе к сосне, и стал выжидать.

            Косач в это время, не обращая на самца вороны никакого внимания, выкликнул свое, известное всем охотникам:

            — Кар-кер-кекс!

            И это было сигналом ко всеобщей драке всех токующих петухов. Ну и полетели во все-то стороны круты перья! И тут, как будто по тому же сигналу, ворона-самец мелкими шагами по мостику незаметно стал подбираться к Косачу.

            Неподвижные, как изваяния, сидели на камне охотники за сладкой клюквой. Солнце, такое горячее и чистое, вышло против них над болотными елочками. Но случилось на небе в это время одно облако. Оно явилось как холодная синяя стрелка и пересекло собой пополам восходящее солнце. В то же время вдруг ветер рванул, елка нажала на сосну и сосна простонала. Ветер рванул еще раз, и тогда нажала сосна, и ель зарычала.

            В это время, отдохнув на камне и согревшись в лучах солнца, Настя с Митрашей встали, чтобы продолжать дальше свой путь. Но у самого камня довольно широкая болотная тропа расходилась вилкой: одна, хорошая, плотная тропа шла направо, другая, слабенькая, — прямо.

            Проверив по компасу направление троп, Митраша, указывая слабую тропу, сказал:

            — Нам надо по этой на север.

            — Это не тропа! — ответила Настя.

            — Вот еще! — рассердился Митраша. — Люди шли, — значит, тропа. Нам надо на север. Идем, и не разговаривай больше.

            Насте было обидно подчиниться младшему Митраше.

            — Кра! — крикнула в это время ворона в гнезде.

            И ее самец мелкими шажками перебежал ближе к Косачу на полмостика.

            Вторая круто-синяя стрелка пересекла солнце, и сверху стала надвигаться серая хмарь.

            Золотая Курочка собралась с силами и попробовала уговорить своего друга.

            — Смотри, — сказала она, — какая плотная моя тропа, тут все люди ходят. Неужели мы умней всех?

            — Пусть ходят все люди, — решительно ответил упрямый Мужичок в мешочке. — Мы должны идти по стрелке, как отец нас учил, на север, к палестинке.

            — Отец нам сказки рассказывал, он шутил с нами, — сказала Настя. — И, наверно, на севере вовсе и нет никакой палестинки. Очень даже будет глупо нам по стрелке идти: как раз не на палестинку, а в самую Слепую елань угодим.

            — Ну ладно, — резко повернул Митраша. — Я с тобой больше спорить не буду: ты иди по своей тропе, куда все бабы ходят за клюквой, я же пойду сам по себе, по своей тропке, на север.

            И в самом деле пошел туда, не подумав ни о корзине для клюквы, ни о пище.

            Насте бы надо было об этом напомнить ему, но она так сама рассердилась, что, вся красная, как кумач, плюнула вслед ему и пошла за клюквой по общей тропе.

            — Кра! — закричала ворона.

            И самец быстро перебежал по мостику остальной путь до Косача и со всей силой долбанул его. Как ошпаренный метнулся Косач к улетающим тетеревам, но разгневанный самец догнал его, вырвал, пустил по воздуху пучок белых и радужных перышек и погнал и погнал далеко.

            Тогда серая хмарь плотно надвинулась и закрыла все солнце со всеми его живительными лучами. Злой ветер очень резко рванул. Сплетенные корнями деревья, прокалывая друг друга сучьями, на все Блудово болото зарычали, завыли, застонали.

            """;
}
